emsesp/EMS-ESP32/src/core/system.cpp
    // get free gpios based on board/platform type
#if CONFIG_IDF_TARGET_ESP32C3
    // https://www.wemos.cc/en/latest/c3/c3_mini.html
    valid_gpios_ = string_range_to_vector("0-10");
#elif CONFIG_IDF_TARGET_ESP32S2
    valid_gpios_ = string_range_to_vector("0-14, 19, 20, 21, 33-38, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32S3
    valid_gpios_ = string_range_to_vector("0-2, 4-14, 17, 18, 21, 33-38, 45, 46");
#elif CONFIG_IDF_TARGET_ESP32 || defined(EMSESP_STANDALONE)
    valid_system_gpios_ = string_range_to_vector("0, 2, 4, 5, 12-15, 18, 19, 23, 25-27, 32-39");
#else
#endif

    // if psram is enabled remove pins 16 and 17 from the list, if set
#if CONFIG_IDF_TARGET_ESP32
    if (ESP.getPsramSize() > 0) {
        valid_system_gpios_.erase(std::remove(valid_system_gpios_.begin(), valid_system_gpios_.end(), 16), valid_system_gpios_.end());
        valid_system_gpios_.erase(std::remove(valid_system_gpios_.begin(), valid_system_gpios_.end(), 17), valid_system_gpios_.end());
    }
#endif
}

// check if a pin is valid ESP32 pin and if not already used, add to the used gpio list
// return false if not allowed or already used
bool System::add_gpio(uint8_t pin, const char * source_name) {
    // check if this is a valid user GPIO
    if (std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin) != valid_system_gpios_.end()) {
        // It's valid now check if it's already in the used list
        if (std::find(used_gpios_.begin(), used_gpios_.end(), pin) != used_gpios_.end()) {
            LOG_DEBUG("GPIO %d for %s is already in use", pin, source_name);
            return false; // Pin is already used
        }
    } else {
        // not valid
        LOG_DEBUG("GPIO %d for %s is not valid", pin, source_name);
        return false;
    }

    // remove the old pin, if exists from used list
    remove_gpio(pin);

    LOG_DEBUG("Adding GPIO %d for %s to used gpio list", pin, source_name);
    used_gpios_.push_back(pin); // add to used list

    return true;
}

// remove a gpio from both valid and used lists
void System::remove_gpio(uint8_t pin) {
    auto it = std::find(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin);
    if (it != valid_system_gpios_.end()) {
        LOG_DEBUG("GPIO %d removed from valid gpio list", pin);
        valid_system_gpios_.erase(std::remove(valid_system_gpios_.begin(), valid_system_gpios_.end(), pin), valid_system_gpios_.end());
    }

    it = std::find(used_gpios_.begin(), used_gpios_.end(), pin);
    if (it != used_gpios_.end()) {
        LOG_DEBUG("GPIO %d removed from used gpio list", pin);
        used_gpios_.erase(it);
    }
}

// return a list of valid and unused GPIOs still available for use
std::vector<uint8_t> System::valid_gpio_list() {
    std::vector<uint8_t> gpios;
    for (const auto & gpio : valid_system_gpios_) {
        if (std::find(used_gpios_.begin(), used_gpios_.end(), gpio) == used_gpios_.end()) {
            gpios.push_back(gpio);
        }
    }
    return gpios;
}

} // namespace emsesp
